{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Embedding", "config": {"input_length": 583, "name": "embedding_11", "embeddings_constraint": null, "mask_zero": false, "dtype": "float32", "batch_input_shape": [null, 583], "activity_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "input_dim": 5000, "trainable": true, "embeddings_regularizer": null, "output_dim": 128}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_11"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "kernel_regularizer": null, "name": "dense_21", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "use_bias": true, "units": 250, "activity_regularizer": null, "trainable": true, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "kernel_regularizer": null, "name": "dense_22", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "use_bias": true, "units": 1, "activity_regularizer": null, "trainable": true, "bias_regularizer": null}}], "keras_version": "2.1.5"}