{"config": [{"config": {"trainable": true, "input_dim": 5000, "batch_input_shape": [null, 583], "embeddings_regularizer": null, "embeddings_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "name": "embedding_22", "embeddings_constraint": null, "output_dim": 128, "input_length": 583, "mask_zero": false, "dtype": "int32", "activity_regularizer": null}, "class_name": "Embedding"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1], "trainable": true, "bias_regularizer": null, "filters": 128, "kernel_constraint": null, "use_bias": true, "name": "conv1d_11", "kernel_size": [3], "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "padding": "same", "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "dilation_rate": [1], "activity_regularizer": null}, "class_name": "Conv1D"}, {"config": {"pool_size": [2], "strides": [2], "name": "max_pooling1d_11", "trainable": true, "padding": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_22", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_43", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "units": 250}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "name": "dense_44", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "activation": "sigmoid", "activity_regularizer": null, "kernel_constraint": null, "units": 1}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.5", "class_name": "Sequential"}