{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Embedding", "config": {"input_length": 583, "name": "embedding_12", "embeddings_constraint": null, "mask_zero": false, "dtype": "float32", "batch_input_shape": [null, 583], "activity_regularizer": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}}, "input_dim": 5000, "trainable": true, "embeddings_regularizer": null, "output_dim": 128}}, {"class_name": "Conv1D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "filters": 128, "padding": "same", "kernel_regularizer": null, "name": "conv1d_6", "kernel_constraint": null, "bias_constraint": null, "activation": "relu", "use_bias": true, "activity_regularizer": null, "kernel_size": [3], "bias_regularizer": null, "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"strides": [2], "pool_size": [2], "name": "max_pooling1d_6", "trainable": true, "padding": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_12"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "kernel_regularizer": null, "name": "dense_23", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "use_bias": true, "units": 250, "activity_regularizer": null, "trainable": true, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "kernel_regularizer": null, "name": "dense_24", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "use_bias": true, "units": 1, "activity_regularizer": null, "trainable": true, "bias_regularizer": null}}], "keras_version": "2.1.5"}