{"keras_version": "2.0.5", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Embedding", "config": {"trainable": true, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "embeddings_constraint": null, "name": "embedding_2", "output_dim": 128, "mask_zero": false, "input_length": 542, "dtype": "int32", "input_dim": 3000, "activity_regularizer": null, "batch_input_shape": [null, 542]}}, {"class_name": "Conv1D", "config": {"trainable": true, "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_regularizer": null, "name": "conv1d_1", "dilation_rate": [1], "use_bias": true, "kernel_size": [3], "filters": 128, "bias_regularizer": null, "activity_regularizer": null, "activation": "relu", "bias_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "strides": [2], "name": "max_pooling1d_1", "pool_size": [2], "padding": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null, "units": 250, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "name": "dense_3", "use_bias": true, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": null, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "name": "dense_4", "use_bias": true, "bias_constraint": null, "activation": "sigmoid", "bias_regularizer": null, "activity_regularizer": null}}]}